### Attributes

### Methods

In [20]:
import pandas as pd #how to reference pandas as pd (shortfom for easy access)

In [22]:
hapiness = pd.read_csv ("hapiness_report_2022.csv") #how to load the dataset in the uploaded file

In [5]:
hapiness.info() #how to search for dataset info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146 entries, 0 to 145
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   country  146 non-null    object
 1   score    146 non-null    float64
 2   income   140 non-null    object
dtypes: float64(1), object(2)
memory usage: 3.6+ KB

In [13]:
hapiness.columns #how to search for columns in the dataset

Index(['country', 'score', 'income'], dtype='object')

In [15]:
hapiness.shape #how to search for rows and columns in the dataset

(146, 3)

In [ ]:
##hapiness['score'] = hapiness['score'].astype('int')

In [24]:
hapiness #how to search for the dataset information

         country  score               income
0        Finland  7.821          High income
1        Denmark  7.636          High income
2        Iceland  7.557          High income
3    Switzerland  7.512          High income
4    Netherlands  7.415          High income
..           ...    ...                  ...
141     Botswana  3.471  Upper middle income
142       Rwanda  3.268           Low income
143     Zimbabwe  2.995  Lower middle income
144      Lebanon  2.955  Lower middle income
145  Afghanistan  2.404           Low income

[146 rows x 3 columns]

In [34]:
hapiness['income'].isna() #how to search for missing income values in the dataset

0      False
1      False
2      False
3      False
4      False
       ...
141    False
142    False
143    False
144    False
145    False
Name: income, Length: 146, dtype: bool

In [32]:
hapiness[hapiness['income'].isna()] #how to search for countries with missing income in the dataset

            country  score income
25           Taiwan  6.512    NaN
78     North Cyprus  5.467    NaN
87      Ivory Coast  5.235    NaN
98   Congo Kinshasa  5.075    NaN
107       Venezuela  4.925    NaN
121       Palestine  4.483    NaN

In [30]:
hapiness[hapiness['country']=='Taiwan'] #how to search for Taiwan in the dataset

   country  score income
25  Taiwan  6.512    NaN

In [28]:
hapiness[hapiness['country']=='Nigeria'] #how to search for Nigeria in the dataset

     country  score               income
117  Nigeria  4.552  Lower middle income

In [59]:
hapiness['score'].max() #how to search for the highest hapiness score in the dataset

7

In [36]:
hapiness.max

<bound method NDFrame._add_numeric_operations.<locals>.max of          country  score               income
0        Finland  7.821          High income
1        Denmark  7.636          High income
2        Iceland  7.557          High income
3    Switzerland  7.512          High income
4    Netherlands  7.415          High income
..           ...    ...                  ...
141     Botswana  3.471  Upper middle income
142       Rwanda  3.268           Low income
143     Zimbabwe  2.995  Lower middle income
144      Lebanon  2.955  Lower middle income
145  Afghanistan  2.404           Low income

[146 rows x 3 columns]>

In [50]:
hapiness[hapiness['country']=='7.821'] #how to search for the country with the highest hapiness score in the datatset

Empty DataFrame
Columns: [country, score, income]
Index: []

In [52]:
hapiness.dropna()

         country  score               income
0        Finland  7.821          High income
1        Denmark  7.636          High income
2        Iceland  7.557          High income
3    Switzerland  7.512          High income
4    Netherlands  7.415          High income
..           ...    ...                  ...
141     Botswana  3.471  Upper middle income
142       Rwanda  3.268           Low income
143     Zimbabwe  2.995  Lower middle income
144      Lebanon  2.955  Lower middle income
145  Afghanistan  2.404           Low income

[140 rows x 3 columns]

In [54]:
Hwn = hapiness.dropna() #how to drop files with missing values (cleaned dataset)

In [56]:
Hwn #how to duplicate a clean dataset without affecting the source file

         country  score               income
0        Finland  7.821          High income
1        Denmark  7.636          High income
2        Iceland  7.557          High income
3    Switzerland  7.512          High income
4    Netherlands  7.415          High income
..           ...    ...                  ...
141     Botswana  3.471  Upper middle income
142       Rwanda  3.268           Low income
143     Zimbabwe  2.995  Lower middle income
144      Lebanon  2.955  Lower middle income
145  Afghanistan  2.404           Low income

[140 rows x 3 columns]

In [ ]:
hapiness.dropna(inplace=True) #how to replace a source file to a cleaned dataset

In [58]:
hapiness.to_csv('hwn.csv') #how to save to CSV